T=30;%仿真时间
Tt=0.05;%仿真间隔
P=[0,0];%炮弹的初始点坐标[X,Y]
V=[50,50];%炮弹的初始速度
M=2;%炮弹自重
C=0.35;%空气阻力系数
rou=1.29;%空气密度
D=0.06;%炮弹直径
S=pi*D^2/4;%炮弹迎风面积
k=0.5*C*rou*S/M;%空气阻力加速度总系数
af=-k*[V(1)^2,V(2)^2];%空气阻力系数
ag=[0,-9.8];%重力加速度
figure;
title('模拟炮弹飞行轨迹');
%xlim([0,600]);ylim([0,140]);
hold on;
for i=0:Tt:T
    if P(2)<0,disp('到达地面，已仿真结束!'),disp([num2str(i),'s']),break,end
    plot(P(1),P(2),'.');hold on;
    a=af+ag;%计算总的加速度
    V=V+a*Tt;%计算当前速度
    P=P+V*Tt;%计算当前位置
    af=-k*[V(1)^2,V(2)^2];%当前空气阻力加速度
    pause(0.01);%动画延迟
    %disp(['已仿真',num2str(i),'s'])
end 
